{
  "JOURNALS": [
    {
      "title": "Ikegbunam, M.; Ejiofor, II.; Duru, V.; Akachukwu, A.; Oranu, E.; Okoyeh, J.N.; Egieyeh, S. Virtual Screening of Selected Phytochemicals From Four Antimalarial Plants Predicted Potential Inhibitors of Wild Typ1. Ikegbunam, M.; Ejiofor, II.; Duru, V.; Akachukwu, A.; Oranu, E.; Okoyeh, J.N.; Egieyeh, S. Virtual Screening of Selected Phytochemicals From Four Antimalarial Plants Predicted Potential Inhibitors of Wild Type and Mutant Forms of Dihydrofolate Reductase-Thymidylate Synthase in Plasmodium sp.. Preprints 2022, 2022020107",
      "doi": "doi: 10.20944/preprints202202.0107.v1"
    },
    {
      "title": "Igbokwe MC, Ibe IC, Nnorom MC, Ejiofor II (2022). In-silico study for African plants with possible beta-cell regeneration effect through inhibition of DYRK1A. Sciences of Phytochemistry. 1(2): 1-16."
    },
    {
      "title": "Ejiofor II, Aparoop D. and Kamaruz Z. Antidiabetic, anthelmintic and antioxidation properties of novel and new phytocompounds isolated from the methanolic stem-bark of Vernonia amygdalina Delile (Asteraceae). Scientific African 10 (2020) e00578."
    },
    {
      "title": "Ejiofor II, Das A, Mir SR, Ali M, Zaman K. Novel phytocompounds from Vernonia amygdalina with antimalarial potentials. Phcog Res 2020; 12: 53-9."
    },
    {
      "title": "Ejiofor II, Das A, Mir S, Ali M, Zaman K. New phytocompounds from Vernonia amygdalina with antimalarial potentials, Curr Trend Pharm Res, 2019, 6(1): 136-144. (Short communication)"
    },
    {
      "title": "Namrata Koushik, Rahul Saikia, Ejiofor II and Kamaruz Zaman. Pharmacognostic studies and evaluation of anti-diabetic efficacy of the leaves and flower of Phlogacanthus thyrsiflorus. Curr Trends Pharm Res, 2017, 4(2):18-38."
    },
    {
      "title": "Ejiofor II, Zaman K, Das A. Effect of Extracts of Vernonia amygdalina in Helminthiasis-A Tropical Neglected Disease. Open Access Journal of Pharmaceutical Research, 2017; 1 (8): 000147."
    },
    {
      "title": "Ejiofor II, Md. Kamaruz Zaman, Aparoop Das. Antidiabetic Evaluations of Different Parts of Vernonia amygdalina. IOSR Journal of Pharmacy and Biological Sciences, 2017; 12(4): 23-28"
    },
    {
      "title": "Uzochukwu IC, Olubiyi OO, Ezebuo FC, Obinwa IC, Ajaegbu EE, Eze PM, Orji CE, Onuoha MC, Ejiofor II and Ikegbunam MN. Ending the Ebola Virus Scourge: A Case for Natural Products. J Pharm Res 2016, 1(1): 000105."
    },
    {
      "title": "Ejiofor II, Uzochukwu IC. Development and Validation of a 96- Microwell Based Assay of Azithromycin by Charge Transfer Complexation with 2, 3-dichloro-5, 6-dicyano-l, 4- benzoquinone (ddq). International Journal of Medicine and Pharmaceutical Science (IJMPS), 2016; 6(4): 35-46."
    },
    {
      "title": "Uzochukwu IC, Ejiofor II. Development and validation of ultraviolet spectrophotometric assay method for cefixime and its tablet/capsule formulations. Journal of Pharmaceutical and Allied Sciences, 2013; 10(2)."
    }
  ],
  "BOOK CHAPTER CONTRIBUTION": [
    {
      "title": "Ejiofor, I.I. , Ekeomodi, C.C. , Elomeme,S., & Ejiofor, M.E. (2022). Therapeutic Inhibitors: Natural Product Options through Computer-Aided Drug Design. In (Ed.), Drug Repurposing - Molecular Aspects and Therapeutic Applications. IntechOpen.",
      "doi": "https://doi.org/10.5772/intechopen.104412"
    },
    {
      "title": "Ejiofor II and Maria-Goretti Chikodili Igbokwe (June 10th 2021). Flavonoids: Understanding Their Biosynthetic Pathways in Plants and Health Benefits [Online First], IntechOpen, DOI: 10.5772/intechopen.96715.",
      "link": "https://www.intechopen.com/online-first/75782"
    },
    {
      "title": "Ejiofor II & Nnorom CM (2021). Regulatory Agencies and The Business Entity. In J.I. Obidile, N.C. Ojiagu & O.C. Ojiaku (Eds.), Innovative Concepts in Entrepreneurship (pp. 448 – 458). Awka. School of General Studies, Nnamdi Azikiwe University, Akwa."
    }
  ]
}
